Revit 2026 API

# TessellatedShapeBuilderBuild Method

---

Builds the designated geometrical objects from the stored face sets. Stores the result in this TessellatedShapeBuilder object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Build()
```
```vb
Public Sub Build
```
```cpp
public:
void Build()
```
```fsharp
member Build : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Throws if data in the stored face sets are so inconsistent, that they cannot be used in their entirety, or if an attempt is made to create unacceptable geometry with too many facets. |

The behavior of this function is affected by Target, Fallback and GStyleId properties of this TessellatedShapeBuilder object. Currently only "Solid/Abort", "AnyGeometry/Mesh" and "Mesh/Salvage" target/fallback combinations are supported. Note that this function does not erase the face sets stored in the builder. If the same builder is used to construct geometrical objects for different collections of face sets, (Clear) should be called while switching from one collection to another.

#### Reference

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace